### Pandas

In [19]:


import pandas as pd
data1= pd.read_csv("D:\\demo\\data.csv")
data1

     Name  Age
0     sai   12
1   harsh   25
2  satyam   36
3    faiz   15
4   gagan   48
5   Rocky   25
6    John   27
7  Ishant   30
8     Bob   29
9  Martyn   35

In [18]:
import pandas as pd
data1= pd.read_csv(r"D:\\demo\\data.csv")
data1

     Name  Age
0     sai   12
1   harsh   25
2  satyam   36
3    faiz   15
4   gagan   48

In [20]:
df = pd.DataFrame({'Name':['Alex', 'Bob', 'sai'],'Age':[10, 12, 25]})
df

   Name  Age
0  Alex   10
1   Bob   12
2   sai   25

In [22]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [23]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [24]:
df.head()

   Name  Age
0  Alex   10
1   Bob   12
2   sai   25

In [25]:
data1.head()

     Name  Age
0     sai   12
1   harsh   25
2  satyam   36
3    faiz   15
4   gagan   48

In [26]:
data1.tail()

     Name  Age
5   Rocky   25
6    John   27
7  Ishant   30
8     Bob   29
9  Martyn   35

In [28]:
data1.shape

(10, 2)

In [30]:
data1.rename(columns = {'Name':'name'})

     name  Age
0     sai   12
1   harsh   25
2  satyam   36
3    faiz   15
4   gagan   48
5   Rocky   25
6    John   27
7  Ishant   30
8     Bob   29
9  Martyn   35

In [ ]:
data1.rename()

#### Axis = 0-rows, 1 -columns

In [35]:
data1.drop('Age', axis = 1).head(2)

    Name
0    sai
1  harsh

In [36]:
data1.Name

0       sai
1     harsh
2    satyam
3      faiz
4     gagan
5     Rocky
6      John
7    Ishant
8       Bob
9    Martyn
Name: Name, dtype: object

In [38]:
data1['Name']

0       sai
1     harsh
2    satyam
3      faiz
4     gagan
5     Rocky
6      John
7    Ishant
8       Bob
9    Martyn
Name: Name, dtype: object

 #### loc()- used for accessing with the labels
 #### iloc()- used for accessing with the index

In [40]:
data1.loc[1]['Name']

'harsh'

In [41]:
data1.iloc[1][0]

'harsh'

In [43]:
data = pd.DataFrame({'Name':['Alex', 'Bob', 'sai'],'class':[3, 2,5]})
data

   Name  class
0  Alex      3
1   Bob      2
2   sai      5

In [51]:
a=pd.concat([data1,data],axis = 1)
a

     Name  Age  Name  class
0     sai   12  Alex    3.0
1   harsh   25   Bob    2.0
2  satyam   36   sai    5.0
3    faiz   15   NaN    NaN
4   gagan   48   NaN    NaN
5   Rocky   25   NaN    NaN
6    John   27   NaN    NaN
7  Ishant   30   NaN    NaN
8     Bob   29   NaN    NaN
9  Martyn   35   NaN    NaN

In [52]:
type(a)

pandas.core.frame.DataFrame

In [56]:
data1.sort_values('Age')

     Name  Age
0     sai   12
3    faiz   15
1   harsh   25
5   Rocky   25
6    John   27
8     Bob   29
7  Ishant   30
9  Martyn   35
2  satyam   36
4   gagan   48

In [72]:
data1.sort_values('Age', ascending = 'False')

     Name  Age
0     sai   12
3    faiz   15
1   harsh   25
5   Rocky   25
6    John   27
8     Bob   29
7  Ishant   30
9  Martyn   35
2  satyam   36
4   gagan   48

In [59]:
data1.Age.sort_values()

0    12
3    15
1    25
5    25
6    27
8    29
7    30
9    35
2    36
4    48
Name: Age, dtype: int64

In [60]:
data1.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [61]:
data1.duplicated().sum()

0

In [62]:
data1.drop_duplicates()

     Name  Age
0     sai   12
1   harsh   25
2  satyam   36
3    faiz   15
4   gagan   48
5   Rocky   25
6    John   27
7  Ishant   30
8     Bob   29
9  Martyn   35

In [66]:
data1.sort_values('Name')

     Name  Age
8     Bob   29
7  Ishant   30
6    John   27
9  Martyn   35
5   Rocky   25
3    faiz   15
4   gagan   48
1   harsh   25
0     sai   12
2  satyam   36